Tekla Open API Reference for Tekla Structures 2025
CustomObservableCollection<T> Methods
The CustomObservableCollection<T> generic type exposes the following members.
Methods
Name | Description
Repopulate
 CustomObservableCollection repopulator, sends notification about property and collection change.
Top
See Also
Reference
CustomObservableCollection<T> Class
Tekla.Structures.Dialog.UIControls Namespace